src/cf/InformationRegisters/ПланируемоеРабочееВремяСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПланируемоеРабочееВремяСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродолжительностьРабочегоВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочаяСмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеСменыСтруктурныхЕдиниц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПланируемоеРабочееВремяСотрудников/Forms/ФормаДобавленияСотрудника/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Должность", Должность);
	Параметры.Свойство("РабочаяСмена", РабочаяСмена);
	
	Если НЕ ЗначениеЗаполнено(Должность) Тогда
		ТекущийЭлемент = Элементы.Должность;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РабочаяСмена) Тогда
		ТекущийЭлемент = Элементы.РабочаяСмена;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Должность) И ЗначениеЗаполнено(РабочаяСмена) Тогда
		ТекущийЭлемент = Элементы.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ПараметрЗакрытия = Новый Структура;
		ПараметрЗакрытия.Вставить("РабочаяСмена", РабочаяСмена);
		ПараметрЗакрытия.Вставить("Должность", Должность);
		ПараметрЗакрытия.Вставить("Сотрудник", Сотрудник);
		
		ЭтотОбъект.Закрыть(ПараметрЗакрытия);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
